app/views/home/index.html.erb

				<li class="nav-header"><p><%= level.name%></p></li>
					<% level.semesters.each do |semester|%>
---
SELECT `semesters`.* FROM `semesters` WHERE `semesters`.`level_id` = 1