app/controllers/levels_controller.rb

  def index
    @levels = Level.all
---
SELECT `levels`.* FROM `levels`

  def show
    @level = Level.find(params[:id])
---
SELECT `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1

  def edit
    @level = Level.find(params[:id])
---
SELECT `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1

  def create
    @level = Level.new(params[:level])

    respond_to do |format|
      if @level.save
---
INSERT INTO `levels` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2012-07-05 13:44:19', 'Level description ', 'Level1', '2012-07-05 13:44:19')

  def update
    @level = Level.find(params[:id])

    respond_to do |format|
      if @level.update_attributes(params[:level])
---
SELECT `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1
UPDATE `levels` SET `name` = 'إعدادى', `updated_at` = '2012-07-09 12:36:17' WHERE `levels`.`id` = 1

  def destroy
    @level = Level.find(params[:id])
    @level.destroy
---
SELECT `levels`.* FROM `levels` WHERE `levels`.`id` = 2 LIMIT 1
DELETE FROM `levels` WHERE `levels`.`id` = 2