app/controllers/semesters_controller.rb

  def index
    if params[:level_id]
      @semesters = Semester.find(:all)
    else
      @semesters = Semester.find_all_by_level_id(params[:level]) || []
---
SELECT `semesters`.* FROM `semesters` WHERE `semesters`.`level_id` IS NULL LIMIT 1

  def show
    @semester = Semester.find(params[:id])
---
SELECT `semesters`.* FROM `semesters` WHERE `semesters`.`id` = 1 LIMIT 1

  def create
    @semester = Semester.new(params[:semester])

    respond_to do |format|
      if @semester.save
---
INSERT INTO `semesters` (`created_at`, `description`, `level_id`, `name`, `updated_at`) VALUES ('2012-07-05 15:01:29', 'dasd', NULL, 'asd', '2012-07-05 15:01:29')

  def destroy
    @semester = Semester.find(params[:id])
    @semester.destroy
---
SELECT `semesters`.* FROM `semesters` WHERE `semesters`.`id` = 2 LIMIT 1
DELETE FROM `semesters` WHERE `semesters`.`id` = 2