app/controllers/semesters_controller.rb

  def index
    @semesters = Semester.all
---
SELECT `semesters`.* FROM `semesters`