app/controllers/subjects_controller.rb

SELECT `semesters`.* FROM `semesters` WHERE `semesters`.`id` = 4 LIMIT 1
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`semester_id` = 4
---
  def index
    @semester
    @semester = Semester.find(params[:semester]) if params[:semester]

    @subjects = @semester.nil? ?  Subject.all : @semester.subjects

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`created_at`, `description`, `name`, `semester_id`, `updated_at`) VALUES ('2012-07-05 15:38:43', 'اللغة العربية', 'عربى', 4, '2012-07-05 15:38:43')
---
  def create
    @subject = Subject.new(params[:subject])

    respond_to do |format|
      if @subject.save